In [1]:
import pandas as pd
import numpy as np

In [26]:
stuff = {'A':[1,2,3], 'B':[4,np.nan,6], 'C':[7,8,9], 'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [27]:
# Get rid of rows with NaN in them
my_df.dropna() # use inplace = True if you want to change my_df

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [28]:
# Drop Columns with NaN
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [30]:
# More than one? Use Threshold
my_df.dropna(thresh=2, axis=1) # thresh - amount of nan values we want to delete columns with (columns because axis=1)

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [32]:
# Replace with fillna()
my_df.fillna('bob')

   A    B  C   D
0  1  4.0  7  10
1  2  bob  8  11
2  3  6.0  9  12

In [33]:
# Use Math Functions
my_df.fillna(my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [38]:
my_df.fillna(my_df['B'].sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12

In [39]:
my_df.fillna(my_df['B'].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12